Repository: 15831944/genericcam
Catalog: i18n/*/GenericCAM.po
Languages: de, it

source: <filepath of document to open>
de: <Pfad zum zu öffnenden Dokument>
it: <filepath del documento da aprire >

source: ---------- error while parsing ----------
de: ---------- Fehler beim Parsen ----------
it: ---------- errore durante l'analisi ----------

source: ---------- error while running ----------
de: ---------- Fehler beim Verarbeiten ----------
it: ---------- errore durante l'esecuzione ----------

source: Generic CAM - log window
de: Generic CAM - Protokollfenster

source: Project:
de: Projekt:
it: Progetto:

source: Object:
de: Objekt:
it: Oggetto:

source: Stock material:
de: Rohmeterial:
it: Archivio materiale:

source: Machine:
de: Maschine:
it: Macchina:

source: Toolbox:
de: Werkzeugsammlung:
it: Cassetta degli utensili:

source: Run:
de: Lauf:
it: Avvia:

source: Stock material
de: Rohmaterial
it: Archivio materiale

source: Target
de: Ziel

source: Toolpath
de: Werkzeugpfad
it: Percorso utensile

source: Open Project...
de: Projekt Öffnen...
it: Apri Progetto...

source: Generic CAM Project (*.prj; *.xml)|*.prj;*.xml|All Files|*.*
de: Generic CAM Projekt (*.prj; *.xml)|*.prj;*.xml|Alle Dateien|*.*
it: Progetto Generic CAM (*.prj; *.xml)|*.prj;*.xml|Tutti i File|*.*

source: Save Project...
de: Projekt speichern...
it: Salva Progetto...

source: Save Project As...
de: Projekt Speichern unter...
it: Salva Progetto Come...

source: Open...
de: Öffnen...
it: Apri...

source: All supported files (*.dxf; *.stl; *.gts)|*.dxf;*.stl;*.gts|DXF Files (*.dxf)|*.dxf|Stereolithography files (STL files) (*.stl)|*.stl|GTS files (*.gts)|*.gts|All files|*.*
de: Alle unterstützten Formate (*.dxf; *.stl; *.gts)|*.dxf;*.stl;*.gts|DXF Dateien (*.dxf)|*.dxf|Stereolithography Dateien (STL Dateien) (*.stl)|*.stl|GTS Dateien (*.gts)|*.gts|Alle Dateien|*.*
it: File supportati (*.dxf; *.stl; *.gts)|*.dxf;*.stl;*.gts|DXF File (*.dxf)|*.dxf|Stereolithography File (STL Dateien) (*.stl)|*.stl|GTS File (*.gts)|*.gts|Tutti i File|*.*

source: Open machine description...
de: Öffnen einer Maschinenbeschreibung...
it: Apri descrizione macchina...

source: Machine descriptions (LUA Files) (*.lua)|*.lua|Text files (*.txt)|*.txt|All files|*.*
de: Maschinenbeschreibungen (LUA Dateien) (*.lua)|*.lua|Text Dateien (*.txt)|*.txt|Alle Dateien|*.*
it: Descrizione macchina (LUA File) (*.lua)|*.lua|File di testo (*.txt)|*.txt|Tutti i File|*.*

source: Open toolbox...
de: Werkzeugsammlung öffnen...
it: Apri cassetta degli utensili...

source: Toolbox (*.xml)|*.xml|All files|*.*
de: Werkzeugsammlung (*.xml)|*.xml|Alle Dateien|*.*
it: Cassetta degli utensili (*.xml)|*.xml|Tutti i File|*.*

source: Save toolbox...
de: Werkzeugsammlung speichern...
it: Salva scatola degli utensili...

source: Open G-Code file...
de: G-Codes laden...
it: Apri G-Code file...

source: G-Code File (*.tap *.cnc *.nc *.ngc *.txt)|*.tap;*.cnc;*.nc;*.ngc;*.txt|Text files (*.txt)|*.txt|All files|*.*
de: G-Code Dateien (*.tap *.cnc *.nc *.ngc *.txt)|*.tap;*.cnc;*.nc;*.ngc;*.txt|Text Dateien (*.txt)|*.txt|Alle Dateien|*.*
it: G-Code File (*.tap *.cnc *.nc *.ngc *.txt)|*.tap;*.cnc;*.nc;*.ngc;*.txt|Text File (*.txt)|*.txt|Tutti i File|*.*

source: Save G-Code file...
de: G-Codes speichern...
it: Salva G-Code File...

source: No tools in toolbox!
de: Keine Werkzeuge in Sammlung gefunden!
it: Non ci sono utensili nella cassetta degli utensili!

source: Type
de: Typ
it: Tipo

source: Diameter
de: Durchmesser
it: Diametro

source: Height
de: Höhe
it: Altezza

source: Cutting
de: Oberfläche schneidet
it: Incisione

source: Yes
de: Ja
it: Si

source: No
de: Nein

source: max. Speed
de: Max. Geschwindigkeit
it: Massima velocità

source: max. Feedrate
de: Max. Vorschub
it: Massimo avanzamento

source: Spaceball by Spacetec IMC
de: Spaceball von Spacetec IMC
it: Spaceball da Spacetec IMC

source: Spaceorb by Spacetec IMC
de: Spaceorb von Spacetec IMC
it: Spaceorb da Spacetec IMC

source: Spacemouse by Logitech/3DConnexion
de: Spacemouse von Logitech / 3DConnexion
it: Spacemouse da Logitech / 3DConnexion

source: No objects in project!
de: Keine Objekte im Projekt!
it: Nessun oggetto nel progetto!

source: &Create new project
de: &Neues Projekt erzeugen
it: &Crea nuovo Progetto

source: &Load Project...
de: &Projekt laden
it: &Avvia Progetto

source: &Save Project as...
de: Projekt speichern unter...
it: &Salva Progetto come...

source: &Save Project
de: Projekt speichern
it: &Salva Progetto

source: &Quit
de: &Beenden
it: &Esci

source: Exit the program
de: Das Programm beenden
it: Esci dal programma

source: &Project
de: &Projekt
it: &Progetto

source: &Load Object File
de: Objekt laden
it: &Avvia File Oggetto

source: &Modify Object
de: Objekt bearbeiten
it: &Modifica Oggetto

source: Edit Subobjects
de: Unterobjekte bearbeiten
it: Modifica suboggetti

source: For DXF files
de: Für DXF Dateien
it: Per i file DXF

source: &Generate Targets
de: Ziele erstellen
it: Generare obiettivi

source: &Object
de: &Objekt
it: &Oggetto

source: &Load Machine...
de: Maschine laden...
it: &Avvia Macchina...

source: &Reload machine
de: Maschine erneut laden
it: &Riavvia Macchina

source: &Machine
de: &Maschine
it: &Macchina

source: Edit Toolbox
de: Werkzeugsammlung bearbeiten
it: Modifica Cassetta degli utensili

source: Load Toolbox...
de: Werkzeugsammlung laden...
it: Avvia Cassetta degli utensili...

source: Save Toolbox...
de: Werkzeugsammlung speichern...
it: Salva Cassetta degli utensili...

source: &Toolbox
de: Werkzeugsammlung
it: &Cassetta degli utensili

source: &Organize Stock
de: R&ohmaterial verwalten
it: &Organizza Archivio

source: &Load Stock...
de: Rohmaterial laden...
it: &Avvia Archivio...

source: &Save Stock...
de: Rohmaterial speichern...
it: &Salva Archivio...

source: &Stock
de: &Rohmaterial
it: &Archivio

source: &Generate Toolpaths
de: Werkzeugpfade erstellen
it: &Generazione Percorsi Utensile

source: Recollect Toolpaths
de: Werkzeugpfade erneuern
it: Riprendi Percorsi Utensile

source: Clean Toolpaths
de: Werkzeugpfade löschen
it: Pulisci Percorsi Utensile

source: &Flip Run
de: Lauf spiegeln
it: &Esegui

source: &Prepare Machinebed
de: Maschinenbett vorbereiten
it: &Preparazione Basamento

source: L&oad G-Codes
de: G-Codes laden
it: &Avvia G-Code

source: &Save G-Codes
de: G-Codes speichern
it: &Salva G-Code

source: Tool&path
de: Werkzeugpfade
it: Percorsi&utensili

source: Change Language
de: Sprache ändern
it: Cambia Lingua

source: Change the programs language.
de: Die Sprache des Programm umschalten.
it: Cambia la lingua del programma.

source: Setup 6DOF &controller
de: Einstellung des 6DOF Kontrollers
it: Impostazione 6DOF &Controllo

source: Setup &Units
de: Einstellung der Einheiten
it: Configurazione &Unità

source: Show &Animation Control
de: Anzeige der Animationssteuerung
it: Mostra &Controllo Animazione

source: S&ettings
de: Einstellungen
it: &Impostazioni

source: View from Top
de: Ansicht von Oben
it: Vista dall'Alto

source: View from Bottom
de: Ansicht von Unten
it: Vista dal Basso

source: View from Front
de: Ansicht von Vorne
it: Vista Frontale

source: View from Back
de: Ansicht von Hinten
it: Vista dal retro

source: View from Left
de: Ansicht von Links
it: Vista da Sinistra

source: View from Right
de: Ansicht von Rechts
it: Vista da Destra

source: &View
de: &Ansicht
it: &Vista

source: &About
de: &Über...

source: About the program
de: Über das Programm
it: Riguardo il programma

source: &Help
de: &Hilfe
it: &Aiuto

source: tool
de: Werkzeug
it: Utensile

source: Display machine
de: Maschine anzeigen
it: visualizza macchina

source: Display material
de: Material anzeigen
it: Visualizza materiale

source: Close
de: Schließen
it: Chiudi

source: Serial port:
de: Serieller Anschluss:
it: Porta seriale:

source: Type of controller
de: Art des Kontrollers
it: Tipo di controller

source: Connect
de: Verbinden
it: Connetti

source: Disconnect
de: Verbindung beenden
it: isconnetti

source: &Close
de: Schließen
it: &Chiudi

source: &Close Window
de: Fenster schließen
it: &Chiudi Finestra

source: Error
de: Fehler
it: Errore

source: &Load Toolbox
de: Werkzeugsammlung laden
it: &Avvia Cassetta Utensili

source: &Save Toolbox
de: Werkzeugsammlung speichern
it: &Salva Cassetta Utensili

source: &Tools
de: &Werkzeuge
it: &Utensili

source: &Settings
de: Einstellungen
it: &Impostazioni

source: New
de: Neu
it: Nuovo

source: Update
de: Aktualisieren

source: Delete
de: Löschen
it: Cancella

source: Tool definition
de: Werkzeugdefinition
it: Definizione utensile

source: Shaft diameter:
de: Schaftdurchmesser:
it: Diametro Albero:

source: Diameter of the part that disappears inside the chuck.
de: Durchmesser des Werkzeugs in Höhe der Spannzange.
it: Diametro della parte che scompare all'interno del mandrino.

source: Shaft length:
de: Schaftlänge:
it: Lunghezza Albero:

source: This is the length of the that disappears inside the chuck.
de: Länge des Werkzeugs, die in der Spannzange verschwindet.
it: Länge des Werkzeugs, die in der Spannzange verschwindet.

source: Maximum speed:
de: Maximale Geschwindigkeit:
it: Massima Velocità:

source: Max. speed: Look at label on box you got the tools shipped in.
de: Maximale Rotationsgeschwindigkeit des Werkzeugs.
it: Massima Velocità: Controllare l'etichetta sulla scatola degli utensili.

source: Feed coefficient:
de: Vorschubkoeffizient:
it: Coefficientete di avanzamento:

source: Feed per tooth: How deep can a tooth cut per revolution. Usually in the range of 0.02 mm to 0.05 mm.
de: Vorschub pro Schneide: Wie tief kann eine schneide pro Umdrehung schneiden. Normalerweise zwischen 0.02 mm und 0.05 mm.
it: Avanzamento per dente: Quanto in profondità può tagliare un dente per giro. Solitamente nell'intervallo di 0.02 mm und 0.05 mm.

source: Number of teeth:
de: Anzahl der Zähne:
it: Numero di denti:

source: Number of teeth around the cutter.
de: Anzahl der Schneiden, die das Werkzeug hat.
it: Numero di denti dell'utensile fresa.

source: Comment:
de: Kommentar:
it: Commento:

source: Tool shape
de: Werkzeugform
it: Forma utensile

source: Linear or bend line
de: Gerade oder gebogene Linie
it: Linea retta o curva

source: Corner: first diameter change, then height change
de: Ecke: erst Durchmesseränderung, dann Höhenänderung
it: Angolo: prima modifica il diametro, poi modifica l'altezza

source: Corner: first height change, then diameter change
de: Ecke: erst Höhenänderung, dann Durchmesseränderung
it: Angolo: prima modifica l'altezza, poi modifica il diametro,

source: Sphere: radius at upper limit, calculate height
de: Kugel: Radius an der oberen Grenze gegeben, Höhe berechnen
it: Sfera: raggio al limite superiore, calcolare l'altezza

source: Sphere: radius at lower limit, calculate height
de: Kugel: Radius an der unteren Grenze gegeben, Höhe berechnen
it: Sfera: raggio al limite inferiore, calcolare l'altezza

source: Diameter of the tool at the end of this segment.
de: Durchmesser des Werkzeugs am Ende dieses Segments.
it: Diametro dell'utensile alla fine di questo segmento.

source: Height of this segment.
de: Höhe dieses Segments.
it: Altezzza di questo segmento.

source: Radius of curvature: Positive radius = convex surface = bulged to the outside. Negative radius = concave surface = bulged to the inside. Radius of 0 = straight line.
de: Radius des Bogens: Positiver Radius = konvexe Oberfläche = nach Außen gewölbt. Negativer Radius = konkave Oberfläche = nach Innen gewölbt. Radius von 0 = Gerade Linie.
it: Raggio di curvatura: Raggio Positivo = superficie convessa = rigonfia verso l'esterno. Raggio Negativo = superficie concava = rigonfia verso l'interno. Raggio uguale a 0 = superficie piana.

source: surface is cutting
de: Oberfläche schneidet
it: Superficie di taglio

source: Size X:
de: Grösse X:
it: Dimensione X:

source: Size Y:
de: Grösse Y:
it: Dimensione Y:

source: Size Z:
de: Grösse Z:
it: Dimensione Z:

source: Max speed:
de: Max. Geschwindigkeit:
it: Massima velocità:

source: Max feedrate:
de: Max. Vorschub:
it: Massimo avanzamento:

source: &Load Object
de: Objekt laden
it: &Avvia Oggetto

source: &Reload Object
de: Objekt erneut laden
it: &Riavvia Oggetto

source: &Save Object As...
de: Objekt &speichern unter...
it: &Salva oggetto come...

source: No objects in project!
de: Keine Objekte im Projekt!
it: Nessun oggetto nel progetto!

source: Size of object
de: Größe des Objekts
it: Dimensione del progetto

source: Rescale
de: Skalieren
it: Ridimensiona

source: Scale proportionally
de: Proportional skalieren
it: Scala proporzionalmente

source: Scale
de: Skalieren
it: Scala

source: label
de: Marke
it: Etichetta

source: Rotate
de: Drehen
it: Ruota

source: Align with stock origin
de: Am Ursprungspunkt des Rohmaterials ausrichten
it: Allinea con il bordo di origine

source: Align with middle of stock
de: An der Mitte des Rohmaterial ausrichten
it: Allinea con la mezzeria del bordo

source: Align with top of stock
de: An der Oberseite des Rohmaterials ausrichten
it: Allinea con la parte superiore del bordo

source: Move
de: Verschieben
it: Muovi

source: Units
de: Einheiten
it: Unità

source: Length Units
de: Längeneinheiten
it: Unità lunghezze

source: inch
de: Zoll
it: Zoll

source: Tolerances
de: Toleranzen
it: Tolleranza

source: Rotational Speed
de: Rotationsgeschwindigkeit
it: Velocità di rotazione

source: Thickness of slice
de: Dicke der Scheibe
it: Spessore della passata

source: from stock material
de: vom Rohmaterial übernehmen
it: dall'archivio materiali

source: Number of slices
de: Anzahl der Scheiben
it: Numero di passate

source: Slice
de: Scheibe
it: Passata

source: Mould
de: Gußform
it: Stampo

source: Support Structure
de: Stützstruktur
it: Struttura di supporto

source: Slot around structure
de: Schlitz um die Struktur
it: Slot attorno alla struttura

source: Distance between supports
de: Abstand zwischen Stützstrukturen
it: Distanza tra i supporti

source: Width of support
de: Breite einer Stützstruktur
it: Larghezza del supporto

source: Height of support
de: Höhe einer Stützstruktur
it: Altezza del supporto

source: Multiple targets per workpiece
de: Mehrere Ziele pro Rohmaterial
it: Obiettivi multipli per pezzo

source: Generate
de: Erzeugen
it: Generare

source: Toolpath:
de: Werkzeugpfad:
it: Percorso utensile:

source: No toolpath selected!
de: Kein Werkzeugpfad ausgewählt!
it: Nessun percorso utensile selezzionato!

source: Time:
de: Dauer:
it: Durata:

source: Last
de: Ende
it: Ultimo

source: Begin
de: Anfang
it: Inizia

source: Play
de: Wiedergabe

source: End
de: Ende
it: Fine

source: Next
de: Weiter
it: Prossimo

source: Untitled
de: Ohne Titel
it: Senza titolo

source: GTS file not readable!
de: GTS Datei kann nicht geöffnet werden!
it: GTS file non leggibile!

source: STL file not readable!
de: STL Datei kann nicht geöffnet werden!
it: STL file non leggibile!

source: DXF file not readable!
de: DXF Datei kann nicht geöffnet werden!
it: DXF file non leggibile!

source: Standard cutter
de: Standardfräser
it: Fresa standard

source: all purpose cylindrical
de: Zylindrischer Universalfräser
it: cilindrica per tutti gli usi

source: About
de: Über

source: Setup 6DOF Controller
de: Einstellung des 6DOF Kontrollers
it: Impostazione 6DOF Controllo

source: An error occured
de: Ein Fehler ist aufgetreten
it: Si è verificato un errore

source: Toolbox
de: Werkzeugsammlung
it: Cassetta utensili

source: Stock
de: Rohmaterial
it: Archivio

source: Object Editor
de: Objekteditor
it: Editor Oggetti

source: Setup Units
de: Einstellung der Einheiten
it: Imposta Unità

source: Prepare Targets
de: Ziele vorbereiten
it: Preparare Obiettivi

source: Toolpath Animation
de: Werkzeugpfad animieren
it: Animazione Percorso Utensile

source: Radius
it: Raggio

source: Name
it: Nome

source: Generic CAM Copyright (C) 2010 Tobias Schaefer French translation & additional debugging: Jacques-Louis Tartarin Italian Translation: Sandro Dalle Nogare Licence for Generic CAM: GNU General Public License version 3.0 (GPLv3) This program comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under certain conditions. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
it: Generic CAM Copyright (C) 2010 Tobias Schaefer Traduzione in Francese & additional debugging: Jacques-Louis Tartarin Traduzione in Italiano: Sandro Dalle Nogare Licenza Generic CAM: GNU General Public License version 3.0 (GPLv3) Questo programma viene fornito SENZA NESSUNA GARANZIA. Questo è software libero, e ognuno è libero di ridistribuirlo sotto certe condizioni. Si dovrebbe aver ricevuto una copia della GNU General Public License insieme a questo programma. in caso contrario, vedi <http://www.gnu.org/licenses/>.

source: Position
it: Posizione
